local config = {
    --[[==================== 系统配置 ====================]]--
    LOG_LV      = 1,                -- 日志输出等级：输出大于该级别日志
    LOG_DROI    = 0,                -- 是否打开卓易日志：0 -> 不打开；1 -> 打开

    LOG_FILE    = 1,                -- 是否输出外部文件：0 -> 不输出；1 -> 输出
                                    -- 注意：卓易云代码请关闭日志文件
    LOG_PATH    = "logs/",          -- 日志文件输出路径
    --[[==================================================]]--

    --[[==================== 日志级别 ====================]]--
    D   = {1, "DEBUG",  Droi and Droi.CloudLogger.DEBUG},
    I   = {2, "INFO",   Droi and Droi.CloudLogger.INFO},
    W   = {3, "WARN",   Droi and Droi.CloudLogger.WARN},
    E   = {4, "ERROR",  Droi and Droi.CloudLogger.ERR},
--  S   = {9, SYSTEM},               -- 卓易无此级别
    --[[==================================================]]--
    
    --[[==================== 日志样式 ====================]]--
    -- [日志级别 时间] 文件名称：行号：信息
    PATTERN     = "[%-6s%s] %s: %s\n",
    --[[==================================================]]--
}

return config
